In [1]:
people = {
    "first": ["Corey", 'Jane', 'John'], 
    "last": ["Schafer", 'Doe', 'Doe'], 
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [2]:
import pandas as pd
df = pd.DataFrame(people)
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [6]:
# combining two colums in DF
df['full_name'] = df['first'] + ' ' + df['last']
df

   first     last                    email      full_name
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer
1   Jane      Doe        JaneDoe@email.com       Jane Doe
2   John      Doe        JohnDoe@email.com       John Doe

In [20]:
df.drop('last', axis=1, inplace=True)

In [21]:
df

                     email      full_name
0  CoreyMSchafer@gmail.com  Corey Schafer
1        JaneDoe@email.com       Jane Doe
2        JohnDoe@email.com       John Doe

In [24]:
df['full_name'].str.split(' ')

0    [Corey, Schafer]
1         [Jane, Doe]
2         [John, Doe]
Name: full_name, dtype: object

In [25]:
df['full_name'].str.split(' ', expand=True)

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John      Doe

In [26]:
df[['first_name', 'last_name']] = df['full_name'].str.split(' ', expand=True)

In [27]:
df

                     email      full_name first_name last_name
0  CoreyMSchafer@gmail.com  Corey Schafer      Corey   Schafer
1        JaneDoe@email.com       Jane Doe       Jane       Doe
2        JohnDoe@email.com       John Doe       John       Doe

In [32]:
df.drop('full_name', axis=1, inplace=True)

In [33]:
df

                     email first_name last_name
0  CoreyMSchafer@gmail.com      Corey   Schafer
1        JaneDoe@email.com       Jane       Doe
2        JohnDoe@email.com       John       Doe

In [35]:
# adding row values
df.append({'first_name':'Tony' })

TypeError: Can only append a Series if ignore_index=True or if the Series has a name

In [36]:
# adding row values
df.append({'first_name':'Tony' },ignore_index=True)

                     email first_name last_name
0  CoreyMSchafer@gmail.com      Corey   Schafer
1        JaneDoe@email.com       Jane       Doe
2        JohnDoe@email.com       John       Doe
3                      NaN       Tony       NaN

In [46]:
people = {
    "first_name": ["Tony", 'Spyder', 'Capten'], 
    "last_name": ["Stark", 'Man', 'America'], 
    "email": ["TonyStark@gmail.com", 'Spyder@email.com', 'Capamwerica@email.com']
}

In [47]:
df2 = pd.DataFrame(people)
df2

  first_name last_name                  email
0       Tony     Stark    TonyStark@gmail.com
1     Spyder       Man       Spyder@email.com
2     Capten   America  Capamwerica@email.com

In [53]:
df_combined = df.append(df2,ignore_index=True, sort=False)
df_combined

                     email first_name last_name
0  CoreyMSchafer@gmail.com      Corey   Schafer
1        JaneDoe@email.com       Jane       Doe
2        JohnDoe@email.com       John       Doe
3      TonyStark@gmail.com       Tony     Stark
4         Spyder@email.com     Spyder       Man
5    Capamwerica@email.com     Capten   America

In [58]:
df_combined.drop(index=5)

                     email first_name last_name
0  CoreyMSchafer@gmail.com      Corey   Schafer
1        JaneDoe@email.com       Jane       Doe
2        JohnDoe@email.com       John       Doe
3      TonyStark@gmail.com       Tony     Stark
4         Spyder@email.com     Spyder       Man

In [65]:
# dropping rows based on conditions
filt = df_combined['last_name'] == 'Doe'
x = df_combined[filt].index
x

Int64Index([1, 2], dtype='int64')

In [66]:
df_combined.drop(index=x)

                     email first_name last_name
0  CoreyMSchafer@gmail.com      Corey   Schafer
3      TonyStark@gmail.com       Tony     Stark
4         Spyder@email.com     Spyder       Man
5    Capamwerica@email.com     Capten   America